--[[ 
▀▄ ▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀          
▀▄ ▄▀                                      ▀▄ ▄▀ 
▀▄ ▄▀    BY Th3_BOOS                   ▀▄ ▄▀ 
▀▄ ▄▀     BY Th3_BOOS (@Th3_BOOS)    ▀▄ ▄▀ 
▀▄ ▄▀ JUST WRITED BY Th3_BOOS          ▀▄ ▄▀   
▀▄ ▄▀          dev1  : dev                 ▀▄ ▄▀ 
▀▄▀▀▄▄▀▀▄▄▀▄▄▀▀▄▄▀▀▄▄▀▄▄▀▀▄▄▀▀▄▄▀▄▄▀▀▄▄▀▀▄▄▀▄▄▀▀
--]]
do

function run(msg, matches)
return [[

ـہآـہآلہـبـوُتــہ ـہآلہذٍيـ ـہ يـ ـہعـہمہلہ عـہلہى مہجـہوُعـہـہآتــہ ـہآلہسُـےـہوُـبـرُ 🇮🇶

يـ ـہعـہمہلہ ـہآلہـبـوُتــہ عـہلہى مہجـہمہوُعـہـہآتــہ سُـےـہوُـبـرُ تــہصـہلہ ـہآلہى5k عـہضـہوُ 🇮🇶

     ≪تــہمہ صـہنہعـہ ـہآلہـبـوُتــہ ـبـوُـہآسُـےـہطـہة ـہآلہمہطـہوُرُ≫
                      『 @DEV_a9 』
            🇮🇶#Dev #آإلذٍيًّبہ🚫🇮🇶
]]
end

return {
description = "Shows bot q", 
usage = "spam Shows bot q",
patterns = {
"مطور البوت$"
},
run = run 
}
end