--[[
 _____     _       _____      _    
|__  /    / \     |__  /     / \   
  / /    / _ \      / /     / _ \  
 / /_   / ___ \    / /_    / ___ \ 
/____| /_/   \_\  /____|  /_/   \_\
   
DEV_ @wounds1                                
DEV_ @moddee123
DEV_ @lll_5
]]

do

local function run(msg, matches)
if is_momod(msg) and matches[1]== "h1" then
return [[
ـہآوُـہآمہرُ ـہآدٍـہآرُة ـہآلہمہجـہمہوُعـہة💢
〰〰〰〰〰〰〰〰
🇮🇶🇮🇶🇮🇶🇮🇶🇮🇶🇮🇶🇮🇶🇮🇶
👑ارفع ادمن _ لہرُفـہَعـہ ـہآدٍمہنہ✝
🔱ارفع اداري _ لہرُفـہَعـہ ـہآدٍـہآرُيـ ـ✝
👑نزل ادمن _ لہتــہنہزُْيـ ـہلہ ـہآدٍمہنہ✝
🔱نزل اداري _ لہتــہنہزُْيـ ـہلہ ـہآدٍـہآرُيـ ـ✝
〰〰〰〰〰〰〰〰                                                                                                                                                                                                     🇮🇶🇮🇶🇮🇶🇮🇶🇮🇶🇮🇶🇮🇶🇮🇶
☠ـہآلہمہدٍيـ ـہرُ_ 
☠ـہآلہـہآدٍمہنہيـ ـہة_

☠ـہآلہـہآدٍـہآرُيـ ـہيـ ـہنہ _
☠ـ ـہآلہـبـوُتــہـہآتــہ_(كـہًشـہفـہَ ـہآلہـبـوُتــہـہآتــہ)
〰〰〰〰〰〰〰〰                                                                                                                                                                                                  🇮🇶🇮🇶🇮🇶🇮🇶🇮🇶🇮🇶🇮🇶🇮🇶
ـہآوُـہآمہرُ ـہآلہطـہرُدٍ وُـہآلہحےـہظـہرُ   ❌👞
👑دي + العرف _ لہلہطـہرُدٍ ✝
🔱حظر + المعرف _لہلہحےـہظـہرُ✝
👑الغاء للحظر _ لہلہغـہًـہآء ـہآلہحےـہظـہرُ✝
🔱قائمة الحظر _لہعـہرُضـہ ـہآلہمہحےـہظـہوُرُيـ ـہنہ✝
〰〰〰〰〰〰〰〰
🇮🇶🇮🇶🇮🇶🇮🇶🇮🇶🇮🇶🇮🇶🇮🇶
👑كتم _لہكـہًتــہمہ عـہضـہوُ✝
🔱كتم _لہلہغـہًـہآء ـہآلہكـہًتــہمہ ✝
👑المكتومن _ لہعـہرُضـہ ـہآلہمہكـہًتــہوُمہيـ ـہنہ✝
🔱منع + الكلمة _لہحےـہظـہرُ كـہًلہمہة✝
👑الغاء المنع+ لہفـہَكـہً حےـہظـہرُ كـہًلہمہة✝
🔱قائمة المنع _ـہآلہكـہًلہمہـہآتــہ ـہآلہمہحےـہظـہوُرُة✝
〰〰〰〰〰〰〰〰                                                                                                                                                                                                                 🇮🇶🇮🇶🇮🇶🇮🇶🇮🇶🇮🇶🇮🇶🇮🇶
(🛠)=ـہآوُـہآمہرُ عـہـہآدٍيـ ـہة
*(⚙)=ـہآوُـہآمہرُ تــہعـہمہلہ ـبـلہرُدٍ                                                                                                                                                                                                                    〰〰〰〰〰〰〰〰                                                                                                                                                                                                               🇮🇶🇮🇶🇮🇶🇮🇶🇮🇶🇮🇶🇮🇶🇮🇶
-🔧 DEV 👹: @DEV_a9
-🔧 channel 👹: @ch_dev
]]
end

if not is_momod(msg) then
return "Only managers 😐⛔️"
end

end
return {
description = "Help list", 
usage = "Help list",
patterns = {
"(h1)"
},
run = run 
}
end

