--[[
 _____     _       _____      _    
|__  /    / \     |__  /     / \   
  / /    / _ \      / /     / _ \  
 / /_   / ___ \    / /_    / ___ \ 
/____| /_/   \_\  /____|  /_/   \_\
   
DEV_ @wounds1                                
DEV_ @moddee123
DEV_ @lll_5
]]

do

local function run(msg, matches)
if is_momod(msg) and matches[1]== "h2" then
return [[

ـہآوُـہآمہرُ ـہآلہمہجـہوُعـہة ـہآلہعـہـہآمہة💢
〰〰〰〰〰〰〰〰〰
🇮🇶🇮🇶🇮🇶🇮🇶🇮🇶🇮🇶🇮🇶🇮🇶🇮🇶
👑ضع اسم + الاسم ✝
🔱ضع صورة ✝
👑ضع قوانين ✝
🔱ضع وصف ✝
👑ضع معرف ✝
🔱ضع الرابط ✝
👑ضع التكرار [5-20] ✝
〰〰〰〰〰〰〰〰〰
لہلہمہسُـےـہحےـہ ـہآكـہًتــہـبـ 📵
👑مسح+ (القوانين+الوصف+الادمنية….  ) ✝
🔱القوانين_لعوض القوانين ✝
👑معلوماتي_معلوماتك ✝
🔱موقعي _ موقعك ✝
👑اشارة للكل + كلمة_لعمل تاك للكل ✝
🔱اعدادات الوسائط _ ✝
👑اعدادات المجموعة _✝


〰〰〰〰〰〰〰〰〰
🇮🇶🇮🇶🇮🇶🇮🇶🇮🇶🇮🇶🇮🇶🇮🇶🇮🇶
-🔧 DEV 👹: @DEV_a9
-🔧 channel 👹: @ch_dev

]]
end

if not is_momod(msg) then
return "Only managers 😐⛔️"
end

end
return {
description = "Help list", 
usage = "Help list",
patterns = {
"(h2)"
},
run = run 
}
end