--[[
 _____     _       _____      _    
|__  /    / \     |__  /     / \   
  / /    / _ \      / /     / _ \  
 / /_   / ___ \    / /_    / ___ \ 
/____| /_/   \_\  /____|  /_/   \_\
   
DEV_ @wounds1                                
DEV_ @moddee123
DEV_ @lll_5
]]


do

local function run(msg, matches)
if is_momod(msg) and matches[1]== "h3" then
return [[

ـہآوُـہآمہرُ ـہآلہحےـہمہـہآيـ ـہة فـہَيـ ـہ ـہآلہمہجـہمہوُعـہة  💢
〰〰〰〰〰〰〰〰                                                                                                                                                                                                🇮🇶🇮🇶🇮🇶🇮🇶🇮🇶🇮🇶🇮🇶🇮🇶
📘يـ ـہسُـےـہتــہخُہدٍمہ
🔐قفل _ لہلہقـہًفـہَلہ
🔓فتح _ لہلہفـہَتــہحےـہ
〰〰〰〰〰〰〰〰
🇮🇶🇮🇶🇮🇶🇮🇶🇮🇶🇮🇶🇮🇶🇮🇶
👑الروابط _ ✝
🔱التكرار _ ✝
👑السبام _ ✝

🔱العربية _ ✝
👑الانكلش _ ✝
🔱الدخول _ ✝
👑الدخول عبر الرابط _ ✝
🔱اشعارات الدخول _ ✝
👑الاضافة _ ✝
🔱 المغادرة _ ✝
👑اليوزنيم _ (@) ✝
🔱التاك _ (#) ✝

👑الرد _ ✝
🔱الكلمات السيئة _ ✝
👑الحماية _ ✝
〰〰〰〰〰〰〰〰
🇮🇶🇮🇶🇮🇶🇮🇶🇮🇶🇮🇶🇮🇶🇮🇶
-🔧 DEV 👹: @DEV_a9
-🔧 channel 👹: @ch_dev
]]
end

if not is_momod(msg) then
return "Only managers 😐⛔️"
end

end
return {
description = "Help list", 
usage = "Help list",
patterns = {
"(h3)"
},
run = run 
}
end
 