--[[
 _____     _       _____      _    
|__  /    / \     |__  /     / \   
  / /    / _ \      / /     / _ \  
 / /_   / ___ \    / /_    / ___ \ 
/____| /_/   \_\  /____|  /_/   \_\
   
DEV_ @wounds1                                
DEV_ @moddee123
DEV_ @lll_01
]]

do 

function run(msg, matches) 
return [[
ـہآوُـہآمہرُ ـہآضـہـہآفـہَيـ ـہة مہتــہـہآحےـہة لہعـہضـہوُ 🐸🚬
〰〰〰〰〰〰〰〰                                                                                                                                                                                                 🇮🇶🇮🇶🇮🇶🇮🇶🇮🇶🇮🇶🇮🇶🇮🇶
👑موقعي _ ✝
🔱معلوماتي _ ✝
👑ايدي _ ✝
🔱ايدي <بلرد_معرف\> _ ✝
👑اضف مذكرة _ ✝
🔱حذف مذكرة_ ✝
👑المذكرة _ جلب مذكرة ع الخاص ✝
〰〰〰〰〰〰〰〰                                                                                                                                                                                                🇮🇶🇮🇶🇮🇶🇮🇶🇮🇶🇮🇶🇮🇶🇮🇶
-🔧 DEV 👹: @DEV_a9
-🔧 channel 👹: @ch_dev

]]

end 

return { 
  description = "Shows bot help", 
  patterns = { 
    "^h5$"
  }, 
  run = run 
} 

end 