--[[
 _____     _       _____      _    
|__  /    / \     |__  /     / \   
  / /    / _ \      / /     / _ \  
 / /_   / ___ \    / /_    / ___ \ 
/____| /_/   \_\  /____|  /_/   \_\
   
DEV_ @wounds1                                
DEV_ @moddee123
DEV_ @lll_5
]]

do 

function run(msg, matches) 
return "👋  ـہآهہلہـہآ ـبـكـہً يـ ـہـہآ : "..msg.from.print_name.."\n\n"
.."[✋🏽تــہوُجـہدٍ هہنہـہآكـہً .5. قـہًوُـہآئمہ لہلہـہآوُـہآمہرُ]".."\n" 
.."ا➖🔹➖🔸➖🔹➖".."\n" 
.."💢- h1 — ـہآوُـہآمہرُ ـہآدٍـہآرُة ـہآلہمہجـہمہوُعـہة ".."\n" 
.."💢- h2 — ـہآوُـہآمہرُ ـہآلہعـہـہآمہة ـہآلہمہجـہمہوُعـہة".."\n" 
.."💢- h3— ـہآوُـہآمہرُ ـہآلہحےـہمہـہآيـ ـہة (1) لہلہمہجـہمہوُعـہة ".."\n" 
.."💢- h4- ـہآوُـہآمہرُ ـہآلہحےـہمہـہآيـ ـہة (2) لہلہمہجـہمہوُعـہة  ".."\n" 
.."💢- h5- لہعـہرُضـہ ـہآوُـہآمہرُ ـہآضـہـہآفـہَيـ ـہة مہتــہحےـہة لہلہعـہضـہوُ".."\n" 
.."ا➖🔹➖🔸➖🔹➖".."\n" 
.."🚀 #DEV_ @DEV_a9 \n 🚀 #channel_ @ch_dev \n 🚀 #DEV_ @ii02ii \n   ا➖🔹➖🔸➖🔹➖ ".."\n " 
.."🗓  "..os.date("!%A, %B %d, %Y\n", timestamp) 

end 

return { 
  description = "Shows bot help", 
  patterns = { 
    "^الاوامر$", 
    "^مساعدة$",
    "^help$"
  }, 
  run = run 
} 

end 

